In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# <center>BOOLEAN MASKING

### Use of boolean masking on series object

In [2]:
power_two = pd.Series([1,2,4,8,16,32,64,128,256,512,1024])
BM = [False,True,False,True,False,True,False,True,False,True,False]

In [3]:
power_two[BM]

1      2
3      8
5     32
7    128
9    512
dtype: int64

In [4]:
BM = power_two>150
power_two[BM]

8      256
9      512
10    1024
dtype: int64

### Use of boolean masking on data frame

In [5]:
data = pd.read_csv('./netflix_titles_2021 (1) (1).csv')
data.head(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [6]:
data.type.unique()

array(['Movie', 'TV Show'], dtype=object)

In [7]:
data.type.nunique()

2

In [8]:
data.cast.unique()

array([nan,
       'Ama Qamata, Khosi Ngema, Gail Mabalane, Thabang Molaba, Dillon Windvogel, Natasha Thahane, Arno Greeff, Xolile Tshabalala, Getmore Sithole, Cindy Mahlangu, Ryle De Morny, Greteli Fincham, Sello Maake Ka-Ncube, Odwa Gwanya, Mekaila Mathys, Sandi Schultz, Duane Williams, Shamilla Miller, Patrick Mofokeng',
       'Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabiha Akkari, Sofia Lesaffre, Salim Kechiouche, Noureddine Farihi, Geert Van Rampelberg, Bakary Diombera',
       ...,
       'Jesse Eisenberg, Woody Harrelson, Emma Stone, Abigail Breslin, Amber Heard, Bill Murray, Derek Graf',
       'Tim Allen, Courteney Cox, Chevy Chase, Kate Mara, Ryan Newman, Michael Cassidy, Spencer Breslin, Rip Torn, Kevin Zegers',
       'Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanana, Manish Chaudhary, Meghna Malik, Malkeet Rauni, Anita Shabdish, Chittaranjan Tripathy'],
      dtype=object)

In [9]:
data.cast.nunique()

7692

### Display Indian directors

In [10]:
BM = data.country=='India'
data[BM].director.value_counts()

David Dhawan          9
Ram Gopal Varma       7
Imtiaz Ali            6
Sooraj R. Barjatya    6
Rajkumar Santoshi     6
                     ..
Sunil Thakur          1
Rai Yuvraj Bains      1
Tharun Bhascker       1
Maha Venkatesh        1
Mozez Singh           1
Name: director, Length: 645, dtype: int64

In [11]:
data[BM].type.value_counts()

Movie      893
TV Show     79
Name: type, dtype: int64

### Display count of movies and TV shows released on 2021

In [12]:
BM = data.release_year==2021
data[BM].type.value_counts()

TV Show    315
Movie      277
Name: type, dtype: int64

### Display the count of movies released on each countries

In [13]:
BM = data.type=='Movie'
data[BM].country.value_counts()

United States                            2058
India                                     893
United Kingdom                            206
Canada                                    122
Spain                                      97
                                         ...
United Kingdom, Russia, United States       1
Paraguay, Argentina                         1
United Kingdom, Malawi                      1
Austria, Iraq, United States                1
United Arab Emirates, Jordan                1
Name: country, Length: 651, dtype: int64

### Display the rating of TV shows in each year

In [14]:
BM = data.rating =='TV-MA'
data[BM].release_year.value_counts()

2018    549
2019    500
2020    469
2017    451
2016    341
2021    270
2015    184
2014     79
2013     64
2012     54
2010     42
2011     27
2008     25
2009     18
2006     17
2007     17
2004     10
2003      8
2005      8
1998      7
2002      7
1999      5
1991      5
1983      4
1993      4
1990      3
1992      3
1997      3
1985      3
1989      2
1978      2
1975      2
1945      2
1979      2
2001      2
1972      2
1982      2
1984      1
1973      1
1986      1
1981      1
1988      1
1970      1
1994      1
1977      1
2000      1
1987      1
1995      1
1963      1
1976      1
1967      1
Name: release_year, dtype: int64

In [15]:
BM = data.rating =='PG'
data[BM].release_year.value_counts()

2018    31
2011    18
2014    15
2017    15
2020    15
2013    14
2016    14
2019    12
2021    11
2015    11
2007    10
2008    10
2009    10
2010     8
2006     8
2004     8
2012     7
2005     5
2001     5
2003     5
2002     4
1976     4
1984     4
2000     4
1993     4
1989     3
1994     3
1992     3
1981     2
1975     2
1982     2
1995     2
1978     2
1977     2
1986     2
1999     2
1983     1
1974     1
1973     1
1997     1
1980     1
1979     1
1985     1
1991     1
1990     1
1996     1
Name: release_year, dtype: int64

### No.of Movies released on September 24, 2021

In [16]:
BM = data.date_added =='September 24, 2021'
data[BM].type.value_counts()

TV Show    7
Movie      3
Name: type, dtype: int64

### No.of Movies/TV shows have 2 season

In [17]:
BM = data.duration=='2 Seasons'
data[BM].type.value_counts()

TV Show    425
Name: type, dtype: int64

### No.of movies have 90 min duration

In [18]:
BM = data.duration=="90 min"
data[BM].type.value_counts()

Movie    152
Name: type, dtype: int64

### Display the countries which listed International TV Shows, TV Dramas, TV Mysteries

In [19]:
BM = data.listed_in=='International TV Shows, TV Dramas, TV Mysteries'
data[BM].country.value_counts()

Japan                     2
Egypt                     2
Turkey                    2
Belgium                   2
Brazil                    2
Taiwan, Malaysia          1
Taiwan                    1
Australia                 1
France                    1
Jordan                    1
Germany                   1
South Africa              1
South Korea               1
Russia                    1
United Arab Emirates      1
Iceland                   1
Thailand                  1
Canada                    1
Denmark, United States    1
Name: country, dtype: int64

### Display movies and TV shows released on South Africa

In [20]:
BM = data.country=='South Africa'
data[BM].title.value_counts()

Blood & Water                             1
Slay                                      1
Vaya                                      1
Kalushi: The Story of Solomon Mahlangu    1
My Wife and I                             1
Blitz Patrollie                           1
Die Ontwaking                             1
French Toast                              1
Liefling                                  1
Pretville                                 1
Queen Sono                                1
Pop, Lock 'n Roll                         1
Uncovered                                 1
All About Love                            1
Baby Mamas                                1
Tjovitjo                                  1
Material                                  1
Hole in the Wall                          1
The Letter Reader                         1
Seriously Single                          1
Kandasamys: The Wedding                   1
My Octopus Teacher                        1
Cold Harbour                              1
Kings of Jo'Burg                          1
How To Ruin Christmas                     1
Diamond City                              1
Loyiso Gola: Unlearning                   1
I Am All Girls                            1
Trippin' with the Kandasamys              1
Catching Feelings                         1
Name: title, dtype: int64

# <center>JOINING AND MERGING

### creating two dictionaries for building a data frame

In [21]:
names = pd.DataFrame({
'id':[1,2,3,4,5],
'name':['Anna','Fahima','Sethu','Anumol','Angel'],
})
ages = pd.DataFrame({
'id':[1,2,3,4,5],
 'age':[22,23,22,24,25]   
})

#### If we have two data frame which are related to one another,we can combine it into one data frame,on the fact that both the dictionary have a common column that we can merge on,here it is id.

In [22]:
data = pd.merge(names,ages,on = 'id')
data.set_index('id',inplace=True)
data

      name  age
id
1     Anna   22
2   Fahima   23
3    Sethu   22
4   Anumol   24
5    Angel   25

In [23]:
names = pd.DataFrame({
'id':[1,2,3,4,5,6],
'name':['Anna','Fahima','Sethu','Anumol','Angel','maggy'],
})
ages = pd.DataFrame({
'id':[1,2,3,4,5,7],
 'age':[22,23,22,24,25,50]   
})

In [24]:
data = pd.merge(names,ages,on='id', how = 'inner')
data.set_index('id',inplace=True)
data

      name  age
id
1     Anna   22
2   Fahima   23
3    Sethu   22
4   Anumol   24
5    Angel   25

#### If we perform the default inner join,we will end up with same data frame as in the begining.Here we only take the keys which both object have that means one to five.

In [25]:
data = pd.merge(names,ages, on='id',how='left')
data.set_index('id',inplace=True)
data

      name   age
id
1     Anna  22.0
2   Fahima  23.0
3    Sethu  22.0
4   Anumol  24.0
5    Angel  25.0
6    maggy   NaN

#### Here we get all the keys from names but not all ages are indexed.

In [26]:
data = pd.merge(names,ages, on='id',how='right')
data.set_index('id',inplace=True)
data

      name  age
id
1     Anna   22
2   Fahima   23
3    Sethu   22
4   Anumol   24
5    Angel   25
7      NaN   50

#### Here we get all keys of ages but not all names are indexed

In [27]:
data = pd.merge(names,ages, on = 'id',how = 'outer')
data.set_index('id',inplace=True)
data

      name   age
id
1     Anna  22.0
2   Fahima  23.0
3    Sethu  22.0
4   Anumol  24.0
5    Angel  25.0
6    maggy   NaN
7      NaN  50.0

#### Here we combine both the left and right merged data frames in to a single data frame.